#tpl=template
tpl={
	"se_com_default"："一般网站的展示样式",
	"se_st_robots":"robots限制展示样式",
	"bk_polysemy":"百科展示样式",
	"tieba_general":"贴吧样式",
	"dianqidaogou01":"电器导购样式",
	"img_address":"图片样式",
	"dict3":"字典样式",
	"site":"站点信息样式",
	"offical_weibo":"官方微博",
	"exactqa":""
}
#srcid=sourceid
srcid={
	1599:"默认(普通结果) 模版名字2数据策略ID",
	1548:"影评 结构化数据[201408添加]",
	1547:"百度百科[201407添加]",
	1543:"面包屑导航 - 结构化数据",
	1542:"百度学术 查看更多相关论文",
	1539:"带 0 - 6 个子链结果",
	1538:"软件下载摘要|小说作者状态类型 结构化数据",
	1537:"组图 百度经验",
	1536:"一般答案 百度知道",
	1535:"未知，模版采用 se_com_image_s 模版",
	1533:"论坛帖子",
	1532:"最佳答案 百度知道",
	1531:"查询词扩展",
	1530:"百度贴吧 更多贴吧相关帖子",
	1529:"权威问答网站结果",
	1528:"百度知道阿拉丁 更多知道相关问题",
	1527:"百度文库标签 更多文库相关文档>",
	1526:"百度文库阿拉丁 更多文库相关文档",
	1525:"百度文库"
	1524:"缩略图结果，但非每个查询词展现图片",
	1523:"robots.txt 文件存在限制指令的结果",
	1522:"百度经验带相册",
,
1523:""

}

"""
1522 

1521 图片_百度百科(自认为与查询词内容相关度较高)

1520 期刊文献

1519 维基百科_国际化

1518 软件下载_国际化

1517 [图文]，但并非每个查询词显示 [图文]

1516 宗教_国际化

1515 电影_国际化

1514 在线文档 结构化数据

1513 软件下载 - 结构化数据

1512 单视频_国际化

1511 [原创] 星火计划

1510 子链_国际化

1509 官网

1508 单视频_站长

1507 微博

1506 单视频

1505 百度知道_高品质(知道达人|权威专家|官方机构)

1504 自动问答

1503 图片_单视频

1502 百度百科

1501 评分 - 结构化数据

1500 无

srcid 百度搜索产品与合作伙伴 网址 提供者

20776 [猜] 百度百科

20679 余额宝相关问题 支付宝个人帮助中心

20631 教育考试 百度知心文库

20548 系列 百度视频

20546 分集剧情 电视猫

20535 [猜] 2014年火车票购票日历

20528 电视剧情介绍 电视猫

20527 百度左侧知心同系列电影 百度视频

20458 官方微博(原知心左侧卡片框)

20457 电视剧 百度视频

20451 分集剧情 电视猫

20426 新浪官微

20423 [猜] 百度知道 医疗健康 更多知道相关问题

20422 [猜] 百度知道 医疗 更多知道相关问题

20408 百度百科(由卫生部临床医生科普平台/百科名医网权威认证)

20407 百度百科(由卫生部临床医生科普平台/百科名医网权威认证)

20406 百度视频

20387 易车网

20324 百度百科(原知心左侧卡片框)

20323 百度图片(原知心左侧卡片框)

20322 百度音乐(原知心左侧卡片框)

20321 百度视频(原知心左侧卡片框)

20319 百度贴吧(原知心左侧卡片框)

20315 付费观看 百度视频

20294 [猜] 热映电影 百度视频 - 百度左侧知心结果

20289 知乎 - 百度阿拉丁

20200 [猜] 猜您喜欢-电影

20199 [猜] 电影风云榜出现

20198 [猜] 演职员表

20172 知心旅游介绍 百度旅游

20135 topik 网上报名

20124 百度左侧知心视频电视剧

20080 北京市预约挂号统一平台

20071 医院科室 好大夫在线

20070 挂号网

20006 医院网站

20005 医院科室

16932 美食/营养 百度经验【组图】

16852 [猜] 腾讯科技

16847 [猜] 热点话题

16821 [猜] 体育直播 新浪网

16809 电视猫

16796 综艺 腾讯视频

16790 美食美客 爱奇艺

16758 悦美网 子链 缩略图

16743 软件下载 中关村在线

16724 [猜] 中国好系统

16689 走势图表 百度乐彩

16653 女子拒搭讪被打死 百度贴吧直播

16641 百度加速乐

16634 [猜] 蘑菇系统之家

16633 [猜] 系统吧

16590 开放式基金 天天基金网

16545 面包屑导航新闻时间轴

16524 疑似推销

16499 [猜] 港股实时行情 - 东方财富网

16498 [猜] 股票实时行情 - 东方财富网

16488 百度知道问律师

16450 百度阿拉丁 robots 禁止抓取

16448 性病科 挂号网

16411 百度软件中心

16391 京东|当当

16387 手机 太平洋电脑网

16355 [猜] 系统之家

16345 [猜] 世界杯 网易体育

16343 [猜] NBA赛季 新浪体育

16312 [猜] 百度贴吧访谈直播

16311 [猜] 股票代码 美股实时行情 新浪财经

16309 [猜] 股票名称 美股实时行情 新浪财经

16277 意甲 新浪体育

16262 带子链 寻医问药网

16228 [猜] 非中国内地明星 伊秀娱乐 伊秀女性网

16198 [猜] 百度经验【组图】

16189 股票实时行情 东方财富网

16188 新浪财经

16184 股票实时行情 东方财富网

16163 [猜] 欧冠新闻时间轴

16140 挂号网

16049 诈骗

16048 寻医问药网

16047 百度在线翻译

16035 [猜] 旅游目的地推荐 - 百度旅游

15988 动漫 腾讯视频

15964 专辑 百度音乐

15958 电视剧 腾讯视频

15940 西甲 新浪体育

15929 [猜] 软件下载 太平洋电脑网

15883 代名词 百度快照在2013年09月-2013年10月间

15880 百度贴吧直播讨论

15863 小道消息 手机中国

15858 单机游戏网

15820 速尔快递客服电话

15817 普通官网

15791 [猜] 快递电话

15785 口袋巴士

15772 逗游

15765 世界杯新闻轴

15758 慧聪网B2B

15751 齐家网

15728 起点中文网

15726 起点中文网

15720 百度经验

15678 巴西队赛程 网易体育

15648 [猜] 旅游攻略 百度旅游

15584 百度站长平台

15560 中关村在线

15557 [猜] 中公教育

15547 整形美容 - 悦美网

15516 人人网同名搜索

15515 人人网同名搜索

15460 中国足彩网

15442 疾病百科 39健康网

15388 手机中国

15357 hao123汽车|hao123头条

15279 客服电话

15232 百度轻应用

15213 整形报价大全 悦美整形网

15200 豆瓣电影

15198 考研时间安排 新浪教育

15195 不凡游戏网

15110 好大夫在线

15109 [猜] 疾病 好大夫在线

15017 热点 网易体育

14994 [猜] 伊秀娱乐明星库

14955 实物价格 和讯黄金

14861 [猜] 选手 乐视网

14726 热点 网易娱乐

14713 [猜] 目的地指南 百度旅游

14664 爱卡汽车网

14611 hao123小游戏

14584 [猜] 百度团购官网

14580 Zinch

14545 品牌词

14515 [猜] 新浪微博|58同城|百度卫士|百度影音|铁路客户服务中心

14510 [猜] 58同城|淘宝网

14480 中甲 搜狐体育

14474 百度投诉中心

14466 汽车点评

14452 快照删除与更新 百度投诉

14435 [猜] 聊天通讯 - 百度软件中心

14421 时刻表 发车间隔 同程网

14331 百度经验【图文】

14305 百度网盘

14287 股吧 - 东方财富网

14283 股吧 - 东方财富网

14188 右侧企业信息

14181 [猜]社交网络 - ipush

14175 欧洲杯

14142 [猜] 系统吧

14134 [猜] 百度图片 医疗健康

14131 百度百科

14110 中国天气网

14098 中国研究生招生信息网

14062 hao123折扣导航

14060 百度硬件

14059 [猜] 马槽 百度经验

14058 电影 百度团购

14022 旅游景点 百度经验【组图】

14004 挂号网

13932 企业官方贴吧

13920 产品报价 中关村在线

13911 手机 天极网

13885 [猜] 百度卫士 更多知道相关问题>>百度知道

13863 百度火车票

13854 电影 - 腾讯视频

13841 英语四六级考试查分 考试吧

13823 hao123下载站

13806 附近电影院 时光网

13798 支付宝客服电话|百度用户服务中心

13750 7k7k小游戏

13747 网页游戏 7k7k小游戏

13741 实时路况

13717 左侧知心 电视剧 爱奇艺

13706 [猜] 腾讯彩票

13679 现货价格 和讯黄金

13631 比赛进程 乐视网

13630 [猜] 中国内地明星 伊秀娱乐 伊秀女性网

13627 亚冠赛程结果 新浪体育

13620 百度知道 ipush

13616 二手房 百度乐居

13598 猎聘网

13580 嫣然天使基金

13466 逗游网

13445 供应信息 慧聪网

13390 腾讯动漫

13369 一听音乐

13360 [猜] 百度贴吧

13355 短信 爱祝福

13336 墨迹天气

13310 手机品牌 太平洋电脑网

13264 畅途网 百度数据开放平台合作伙伴

13260 汽车百科知识 汽车点评

13255 [猜] 景点目的地 百度旅游

13231 欧洲冠军联赛 - 新浪体育

13216 影讯 最近上映电影 Mtime时光网

13174 列车时刻表查询及在线预订 去哪儿

13118 比赛进程 百度视频

13111 中国红十字基金会

13096 百度团购

13039 客服电话 去哪儿

13031 城市天气预报 中国天气网

12967 百度软件

12965 ABAB小游戏

12946 动漫 爱奇艺

12926 [猜] 亚信峰会直播 凤凰网

12906 [猜]城市 - 百度团购

12904 [猜] 中国网络电视台

12903 [猜] 百度团购导航

12880 [猜] 国内省市级|国外国家级目的地 百度旅游

12840 百度乐居

12839 招远麦当劳

12809 综艺 爱奇艺

12729 百度票务

12726 医院 好大夫在线

12645 [猜] 轿车 易车网

12644 软件排行榜 太平洋下载

12643 百度团购第 2 种起点

12616 开奖查询 百度乐彩

12610 汽车点评

12605 百度乐彩

12594 [猜] 腾讯视频

12558 说明书 寻医问药网

12542 英语四六级真题试卷 新浪教育

12521 开心网会员登录

12512 录取分数线 高考招生 中国教育在线

12501 育儿 太平洋亲子网

12500 育儿检测 太平洋亲子网

12465 弱相关推荐

12403 壹基金

12391 装修 齐家网

12347 产品导航 手机 太平洋电脑网

12346 商户 大众点评网

12345 食品营养价值 美食天下

12342 [猜] NBA决赛 热点直播 网易体育

12270 18183 手游网

12220 女装、女鞋排行榜 百度搜索风云榜

12215 今日游戏排行榜 百度搜索风云榜

12185 有妖气

12123 专题 百度音乐

12121 综艺 风行网

12118 百度相册

12114 百度经验【组图】

12102 自学考试 考试吧

12086 百度阅读

12049 百度推广投诉客服电话

12048 客服电话

12021 新闻时间轴

11952 百度口碑

11940 全国省份天气预报 中国天气网

11939 网页游戏开服表 07073游戏网

11933 健身 中国易登网

11899 [猜] 维基百科|百度团购|百度杀毒

11898 知名网站

11852 法甲 新浪体育

11838 [猜] 客服电话表

11830 百度软件中心

11828 融360

11810 区号查询

11803 爱漫画

11782 手机大全 - 手机中国

11757 爱漫画

11708 组图 美食天下

11692 地铁 百度地图

11677 网易163邮箱登录

11675 五笔编码汉语拼音查询 ip138

11640 考试吧

11620 公益咨询电话

11582 中超 新浪体育

11547 求医网

11539 足球联赛对战表 新浪体育

11520 观后感、评论 豆瓣电影

11519 影评、简介及基本信息 豆瓣电影

11490 国际原油期货价格 国际石油网

11471 国家授时中心标准时间

11463 畅途网 百度数据开放平台合作伙伴

11462 [猜] 官方订票电话

11443 国际足联排名 新浪体育

11442 网球世界排名 新浪体育

11439 乒乓球世界排名 新浪体育

11437 羽毛球世界排名 新浪体育

11436 233网校

11409 公益咨询电话

11386 百度贴吧 查看更多贴子>>

11353 [猜] 铁路客户服务中心官网

11301 人民网宏观经济数据库

11263 中国妇女发展基金会

11260 百度文库认证机构

11252 百度文库认证作者

11239 中国宋庆龄基金会

11228 综艺节目联系方式 爱奇艺

11205 新浪星座查询

11196 12306 官网

11175 [猜] 百度贴吧直播

11129 [猜] 综艺节目联系方式

10936 英语四六级 新浪教育

10927 电视节目表

10904 全国大学英语四六级考试(CET)官方成绩查询

10858 高考分数线 新浪高考

10827 高考各省市录取分数线汇总 新浪高考

10806 手机中国

10797 装软件 - hao123下载站

10794 电影 爱奇艺

10792 快速查询 求医网

10789 宜家|百度云图|世界知识产权组织|英雄联盟

10788 亲子百科 太平洋亲子网

10776 Mtime时光网

10775 影评、简介及放映时间查询 Mtime时光网

10764 高考查分 新浪高考

10744 考研分数线查询 新浪教育

10723 考研真题试卷 新浪教育

10693 世界时间 百度开放平台

10678 基金吧 天天基金网

10652 团体 百度百科

10646 [猜] 客船沉没

10639 [猜] 中国移动客服电话

10610 百度招聘

10594 飞翔游戏

10577 网页游戏 百度游戏

10530 药品通 39健康网

10501 [猜] 直播热点话题 新浪娱乐

10500 [猜] 微信客服 百度知道 更多知道相关问题>>

10422 [猜]时间轴新闻

10396 [猜] 搜狐健康

10393 [猜] 基于 IP 地理位置回答

10385 有道翻译

10382 尾号限行

10319 热门视频 太平洋游戏网

10317 网易彩票

10315 开奖详情查询 网易彩票

10306 资讯 网易彩票

10298 2014年全年公休假放假安排 中国政府网

10268 百度经验【组图】

10254 猎聘网

10249 药品搜索 丁香园

10244 第 2 种百度经验

10240 [猜] 开奖 新浪彩票

10239 乐游网

10219 第 2 种客服电话

10213 易登网

10210 手机号码归属地查询

10201 货币基金 天天基金网

10199 [猜] 医院 - 悦美整形网

10197 [猜] 转诊预约 - 好大夫在线

10183 时刻表 票价 同程网

10178 展现多方观点 百度知道

10175 找好医院 家庭医生在线

10162 装修效果图大全 齐家网

10161 [猜]疾病 寻医问药专家网

10139 人民币利率 和讯网

10118 [猜] 开奖 hao123彩票

10094 [猜] 开奖结果 体坛网

10077 公务员考试真题试卷 中公教育

10023 英超 新浪体育

10015 [猜] 时间轴新闻 腾讯网|新浪网

7136 就医助手 39健康网

7127 百度药品

7123 [猜] 好大夫在线 推荐医院

7092 航班信息

7086 4399小游戏

7084 点评 中关村在线

7079 数码系列 - 中关村在线

7076 详情页 - 中关村在线

7074 菜谱优质结果

7072 [猜] 洛克王国 4399

7032 车次查询 去哪儿

7027 物品 178游戏网

6845 小说

6833 百度百科 多义词

6832 旅游景点大全

6827 由于失信已被列入国家失信被执行人名单

6826 该企业已被列入全国失信被执行人名单中！

6819 全国法院失信被执行人名单

6817 百度视频

6811 百度音乐

6804 最新报价 配置 图片 口碑 油耗 易车网

6801 车型 - 易车网

6737 [猜] 游戏 最新招聘信息

6736 [猜] 文字 最新招聘信息

6735 site特型 百度站长平台

6727 [猜] 左侧动漫作品

6714 最佳答案

6705 电视剧榜单

6700 电影 - 百度团购

6691 歌曲 - 百度音乐

6690 电影 - 百度视频

6680 百度购物搜索

6677 百度应用

6670 百度团购

6666 百度招聘搜索

6665 百度招聘会搜索

6653 [猜] 百度知心最佳答案

6652 号码大全

6112 [猜] 电视剧 百度视频

6018 日历

6017 最新汇率

6014 提问到百度知道 QQ 356252296

6009 万年历

6008 度量衡换算查询

6007 计算器

6006 IP地址查询

6004 手机归属地

91 百度百科_多义词

85 百度翻译|百度词典

81 百度百科

80 百度百科专有名词

35 百度移动应用

10 百度贴吧

9 百度词典

2 百度地图

srcid 百度汇与实时结果 网址 提供者

29250 十二星座健康运势 百度健康

29205 高等教育自学考试 百度教育

29204 考试 百度教育

29200 考试 百度教育

29181 产品大全 百度财富

29166 页游 开始游戏 百度爱玩

29152 游戏专区 17173

29140 二手车 百度汽车

29129 开始游戏 百度爱玩

29127 百度爱玩

29120 热门网页游戏平台 百度爱玩

29118 百度品牌特卖

29116 百度品牌特卖

29114 百度品牌特卖

29099 百度教育考试

29096 留学图片资讯 百度教育

29094 百度教育迷你相关课程

29093 机构 百度教育

29090 课程 百度教育

29089 百度健康

29088 混合 - 百度健康

29087 [猜] 百度知心_健康_知识_图片

29083 药品频道 寻医问药网 百度健康

29081 手术 百度健康

29080 知识图片 - 百度健康

29070 网页游戏 百度爱玩

29051 百度微购

28093 去哪儿网门票频道

28092 去哪儿网门票频道

28072 去哪儿网酒店预定查询

28057 去哪儿度假频道

28056 [猜] 去哪儿度假频道

28054 机票查询 去哪儿

28050 疾病 百度知道

28042 地图 第 2 版 百度旅游

28041 地图 第 2 版 百度旅游

28040 景点介绍 第 2 版 百度旅游

28025 [猜] 百度团购首页格

28022 百度地图

28010 百度地图 城市

28002 百度地图

27003 携程攻略

27002 携程攻略

4002 单位换算 百度阿拉丁

4001 快递查询 快递100

101 当当|一淘|英语四六级查询 考试吧

43 去百度知道提问

37 最新图片

34 最新微博结果

23 百度翻译

19 最新相关消息

5 百度音乐

4 百度图片

1 百度视频

srcid 右侧知心资源 网址 提供者

28000 右侧百度地图

20864 右侧推荐模式 XXIV 第 2 行

20863 右侧推荐模式 XXIV 第 1 行

20862 右侧推荐模式 XXIII 第 3 行

20861 右侧推荐模式 XXIII 第 2 行

20860 右侧推荐模式 XXIII 第 1 行

20857 右侧相关推荐

20853 右侧推荐模式 XXII 第 2 行

20850 右侧推荐模式 XXI 第 2 行

20836 右侧有百科的其他人还搜II

20830 右侧推荐模式 XX 第 3 行

20829 右侧推荐模式 XX 第 2 行

20828 右侧推荐模式 XX 第 1 行

20827 右侧推荐模式 XX 第 3 行

20826 右侧推荐模式 XX 第 2 行

20825 右侧推荐模式 XX 第 1 行

20824 百度百科推荐

20819 右侧推荐模式 XVIII 第 3 行

20816 右侧推荐模式 XVII 第 3 行

20815 右侧推荐模式 XVII 第 2 行

20814 右侧推荐模式 XVII 第 1 行

20813 右侧推荐模式 XVI 第 3 行

20812 右侧推荐模式 XVI 第 2 行

20811 右侧推荐模式 XVI 第 1 行

20810 右侧推荐模式 XV 第 3 行

20809 右侧推荐模式 XV 第 2 行

20808 右侧推荐模式 XV 第 1 行

20803 右侧推荐模式 XIV 第 3 行

20802 右侧推荐模式 XIV 第 2 行

20801 右侧推荐模式 XIV 第 1 行

20800 右侧推荐模式 XIII 第 3 行

20799 右侧推荐模式 XIII 第 2 行

20798 右侧推荐模式 XIII 第 1 行

20785 右侧推荐模式 XII 第 3 行

20784 右侧推荐模式 XII 第 2 行

20783 右侧推荐模式 XII 第 1 行

20772 右侧有百科的其他人还搜

20676 右侧推荐模式 XI 第 3 行

20675 右侧推荐模式 XI 第 2 行

20674 右侧推荐模式 XI 第 1 行

20616 右侧推荐模式 X 第 3 行

20615 右侧推荐模式 X 第 2 行

20614 右侧推荐模式 X 第 1 行

20611 右侧推荐模式 IX 第 3 行

20610 右侧推荐模式 IX 第 2 行

20608 右侧推荐模式 IX 第 1 行

20599 右侧推荐模式 VIII 第 3 行

20598 右侧推荐模式 VIII 第 2 行

20597 右侧推荐模式 VIII 第 1 行

20581 右侧推荐模式 VII 第 3 行

20580 右侧推荐模式 VII 第 2 行

20579 右侧推荐模式 VII 第 1 行

20558 右侧相关搜索

20325 [猜] 暮光之城右侧演职员表出现

20318 [猜] 暮光之城右侧其他人还搜出现

20317 右侧没有百科的其他人还搜

20304 右侧 百科 PK策略 右侧提示

20303 右侧 百科 PK策略 右侧提示

20118 [猜] 右侧推荐模式 VI 第 2 行

20117 [猜] 右侧推荐模式 VI 第 1 行

20112 右侧推荐模式 V 第 2 行 百科 PK策略 右侧提示

20111 右侧推荐模式 V 第 1 行 百科 PK策略 右侧提示

20110 右侧推荐模式 IV 第 3 行 百科 PK策略 右侧提示

20109 [猜] 右侧推荐模式 IV 第 2 行

20108 右侧推荐模式 IV 第 1 行 百科 PK策略 右侧提示

16672 右侧发生暴力袭击案时如何自救

14748 右侧昆明恐怖事件概况

14489 右侧2014世界杯倒计时 网易体育

14186 右侧春节小伙伴们还搜什么列表

14164 右侧 攻略 共存策略 右侧提示

14161 右侧 攻略 共存策略 右侧提示

14155 右侧 攻略 共存策略 右侧提示

14152 右侧 攻略 共存策略 右侧提示

14149 右侧 攻略 共存策略 右侧提示

14144 右侧 攻略 共存策略 右侧提示

13757 右侧 攻略 共存策略 右侧提示

12390 蓝色时间线

12523 右侧 攻略 共存策略 右侧提示

12138 右侧 攻略 共存策略 右侧提示

12120 右侧昆明主要献血点

11722 右侧点击祈福

11267 右侧 攻略 共存策略 右侧提示

10822 右侧今日谈资 网易体育

10778 右侧认亲拜年

10090 翻译强需求阿拉丁右侧添加百度翻译文字链

6854 百度视频推荐

6852 周围人都在搜

6851 百度百科推荐

6730 右侧推荐模式 III 第 3 行

6729 右侧推荐模式 III 第 2 行

6728 右侧推荐模式 III 第 1 行

6727 右侧推荐模式 II 第 3 行 PK策略 右侧提示

6726 右侧推荐模式 II 第 2 行 PK策略 右侧提示

6725 右侧推荐模式 II 第 1 行 PK策略 右侧提示

6717 右侧推荐模式 I 第 3 行 PK策略 右侧提示

6716 右侧推荐模式 I 第 2 行 PK策略 右侧提示

6715 右侧推荐模式 I 第 1 行 PK策略 右侧提示

6708 右侧 模糊推荐查询词 PK策略 右侧提示

6707 右侧 模糊推荐查询词 PK策略 右侧提示

6706 右侧 模糊推荐查询词 PK策略 右侧提示

6698 右侧 热榜

657 右侧 地标 避让策略 右侧提示

542 右侧 地标 避让策略 右侧提示

119 右侧 品牌专区 避让策略 右侧提示

srcid 顶部提示 网址 提供者

40595 为您推荐

40582 为您推荐

srcid 未归类 网址 提供者

20755 百度视频推荐

16428 网页晃动效果

15622 网页旋转效果

12857 网页反转效果

11171 网页跳跃效果

6850 百度图片推荐

6679 网页应用 百度轻应用

6652 号码大全

6109 百度全网寻人

6108 日历-新
"""



